test-ci/1DBoundaryLayer/constant/kineticTheoryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      kineticTheoryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

kineticTheory   off;

equilibrium     off;

limitProduction off;

e               e [ 0 0 0 0 0 0 0 ] 0.8;

alphaMax        alphaMax [ 0 0 0 0 0 0 0 ] 0.6;

DiluteCut       DiluteCut [ 0 0 0 0 0 0 0 ] 0.00000;

ttzero          ttzero [ 0 0 1 0 0 0 0 ] 0;

ttone          ttone [ 0 0 1 0 0 0 0 ] 0;

MaxTheta       MaxTheta [ 0 2 -2 0 0 0 0 ] 0.5;

phi             phi [ 0 0 0 0 0 0 0 ] 32.0;

psi             psi [ 0 0 0 0 0 0 0 ] 0.0;

KineticJ1      KineticJ1 [ 0 0 0 0 0 0 0 ] 1; //turn off the viscous dissipation

KineticJ2       KineticJ2 [ 0 0 0 0 0 0 0] 0;

KineticJ3       KineticJ3 [ 0 0 0 0 0 0 0] 0;

viscosityModel  Syamlal;

conductivityModel Syamlal;

granularPressureModel Lun;

frictionalStressModel SrivastavaSundaresan;

radialModel     CarnahanStarling;



// ************************************************************************* //
